% 몇분전부터 대기를 해야 건조기를 사용할 수 있을까
%--------------------------------------------------------------------------------
% 건조기는 0~50까지 random, 만약 0이 되어도 내 세탁기가 안 끝났으면 소용 없음
% 내 앞에 사람이 없을 때는 건조기가 0이고 내 세탁기도 0일 때, 걸리는 시간을 구하면 됨
% 내 앞에 사람이 있다면 가장 시간이 적게 남은 건조기를 선택
% 내 앞에 대기타는 사람 인원 수 만큼 시간이 적게 남은 건조기 후보가 뒤로감.
% 건조기 시간이 끝났는데 가지러 오지 않는 사람 인원 수(건조기 개수 rand해서 random개수만큼 건조기들 선택)
% 가지러 오지 않는 사람들이 늦는 시간 0~5분 random
%---------------------------------------------------------------------------------

data=[50 78 56 72 55 50 66 50 68 60 56 69 68 55 65 68 67 54 70 70 60 86 50 62 52 64 55 56 58 72 73 76 78 70 50 58 60 64 67 73 51 71 57 ...
    58 65 60 62 65 62 62 52 50 53 66 63 56 66 78 56 72 55 66 50 68 60 56 69 68 55 65 68 67 54 70 70 50 60 86 62 52 64 55 56 58 72 73 ...
    76 78 70 74 60 64 67 73 51 71 57 58 65 60 62 65 62 62 52 53 66 63 56 66 69 83 82 68 62 89 70 67 84 76 79 90 68 92 60 86 62 52 64 ...
    55 56 58 72 73 76 78 70 58 60 64 67 73 51 66 69 52 58 73 75 74 87 73 59 62 63 64 78 56 72 75 66 50 69 68 55 65 68 67 54 70 70 50 ...
    60 86 62 52 64 55 56 58 72 73 76 78 82 74 80 92 94 73 51 71 57 58 65 60 62 65 62 62 73 53 66 63 56 66 69 83 82 68 62 89 70 67 84 ...
    68 74 78 96 79 65 69 78 79 58 59 72 69 62 79 50 82 71 58 63 72 83 66 77 62 62 52 53 66 63 76 66 69 83 71 57 58 65 60 62 65 82 68 ...
    62 89 70 67 84 76 79 74 68 88 58 72 73 76 78 70 58 60 64 67 60 86 62 52 64 55 56 73 51 66 69 52 58 73 89 76 78 55 66 50 69 68];

subplot(1,2,1);
histfit(data);

A=sort(data);
n=length(A);

if mod(n,2)==0
    mid=n/2;
    Q2=(A(mid)+A(mid+1))/2; 
    Lo=A(1:mid);
    Up=A(1,(mid+1):n);
else
    mid=(n+1)/2;
    Q2=A(mid);
    Lo=A(1,1:mid);
    Up=A(1,mid:n);
end

Q_n=length(Lo);
if mod(Q_n,2)==0
    mid=Q_n/2;
    Q1=(Lo(mid)+Lo(mid+1))/2;
    Q3=(Up(mid)+Up(mid+1))/2;
else
    mid=(Q_n+1)/2;
    Q1=Lo(mid);
    Q3=Up(mid);
end

IQR=Q3-Q1;
U=Q3+1.5*IQR;
L=Q1-1.5*IQR;
subplot(1,2,2);
hold on

for k=1:n
    if A(k)<=U
        U_ex=A(k);         
    else
        plot(1,A(k),'r*');
        text(1.1,A(k),['Outlier : ',num2str(A(k))]);
    end
    ku=n+1-k;
    if A(ku)>=L
        L_ex=A(ku);
    else
       plot(1,A(ku),'r*');
       text(1.1,A(ku),['Outlier : ',num2str(A(ku))]);
    end
end

plot([0.95 1.05 1.05 0.95 0.95],[Q1 Q1 Q3 Q3 Q1],'b');
plot([0.95 1.05],[Q2 Q2],'r');
text(1.1,Q2,['Q2(median) : ',num2str(Q2)]);
text(1.1,Q3,['Q3 : ',num2str(Q3)]);
text(1.1,Q1,['Q1 : ',num2str(Q1)]);

plot([0.98 1.02],[U_ex U_ex],'k'); 
text(1.05,U_ex,['Up Ext : ',num2str(U_ex)]);
plot([0.98 1.02],[L_ex L_ex],'k'); 
text(1.05,L_ex,['Lo Ext : ',num2str(L_ex)]);
text(1.01,(U_ex+Q3)/2,'whisker');
text(1.01,(L_ex+Q1)/2,'whisker');

plot([1 1],[Q3,U_ex],'k--',[1 1],[Q1,L_ex],'k--');
xlim([0.5 1.5]);
xticks([0.5 1 1.5]);
grid on
hold off

mean(data)
mode(data)
var(data)
std(data)